#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
github_repository.public["legacy"]: Refreshing state... [id=legacy]
github_repository.public["tf-aws-luperca"]: Refreshing state... [id=tf-aws-luperca]
github_repository.public["prj-file-creator"]: Refreshing state... [id=prj-file-creator]
github_repository_file.gitignore_file["legacy"]: Refreshing state... [id=legacy/.gitignore]
github_repository_file.gitignore_file["prj-file-creator"]: Refreshing state... [id=prj-file-creator/.gitignore]
github_branch_protection.pub_release["prj-file-creator"]: Refreshing state... [id=BPR_kwDOH2qOss4Br5fR]
github_repository_file.gitignore_file["tf-aws-luperca"]: Refreshing state... [id=tf-aws-luperca/.gitignore]
github_branch_protection.pub_main["prj-file-creator"]: Refreshing state... [id=BPR_kwDOH2qOss4Br5fS]
github_branch_protection.pub_main["tf-aws-luperca"]: Refreshing state... [id=BPR_kwDOHaIxaM4BjR9A]
github_branch_protection.pub_main["legacy"]: Refreshing state... [id=BPR_kwDOHaAc_84BjPna]
github_branch_protection.pub_release["legacy"]: Refreshing state... [id=BPR_kwDOHaAc_84BjPnZ]
github_branch_protection.pub_release["tf-aws-luperca"]: Refreshing state... [id=BPR_kwDOHaIxaM4BjR9B]
github_repository_file.license_file["prj-file-creator"]: Refreshing state... [id=prj-file-creator/LICENSE]
github_repository_file.license_file["legacy"]: Refreshing state... [id=legacy/LICENSE]
github_repository_file.license_file["tf-aws-luperca"]: Refreshing state... [id=tf-aws-luperca/LICENSE]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # github_repository.public["prj-file-creator"] has changed
  ~ resource "github_repository" "public" {
      ~ branches               = [
          ~ {
                name      = "main"
              ~ protected = false -> true
            },
        ]
      + description            = "Create basic directory and file structure to terraform projects. My personal approach may not be a best practice"
      ~ etag                   = "W/\"7ad35d0973dc03dccf5dfb27e989b1da47e62cfc3290516012f0de8d4f41154e\"" -> "W/\"9281ffcf2237daca3bf2688330481e1c04baf8bac85e9f47bde170c953dcd39d\""
        id                     = "prj-file-creator"
        name                   = "prj-file-creator"
      + topics                 = [
          + "shell-script",
        ]
        # (25 unchanged attributes hidden)
    }

  # github_repository.public["tf-aws-luperca"] has changed
  ~ resource "github_repository" "public" {
      ~ etag                   = "W/\"5513b6ad293e9cb31008783d4a85eee319928647a3248b4de237a38db60061a4\"" -> "W/\"ae1c508ccd209f38bc7aec1fe09ceae8961286763b43d8f86cf2fb9bc983d4ab\""
        id                     = "tf-aws-luperca"
        name                   = "tf-aws-luperca"
        # (28 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.pub_main["nodejs-lab"] will be created
  + resource "github_branch_protection" "pub_main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.pub_release["nodejs-lab"] will be created
  + resource "github_branch_protection" "pub_release" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "release/*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # github_repository.public["nodejs-lab"] will be created
  + resource "github_repository" "public" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "nodejs-lab"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # github_repository_file.gitignore_file["nodejs-lab"] will be created
  + resource "github_repository_file" "gitignore_file" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by GMaC"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #################################################
            # THIS IS A JOIN OF OTHER TEMPLATES             #
            # THE IGNORE ARE SEPARATED BY A COMMENT         #
            # WITH THE LANGUAGE/FRAMEWORK NAME              #
            # THIS IS CREATED TOGETHER WITH THE REPO        #
            # BUT IT ISN'T UPDATED, SO ANY ADDITION IS DONE #
            # IN A NEW COMMIT IN THE CREATED REPO           #
            # ALL OF THIS STUFF CAME FROM:                  #
            # https://github.com/github/gitignore           #
            #################################################
            
            # TERRAFORM #
            
            **/.terraform/*
            *.tfstate
            *.tfstate.*
            crash.log
            crash.*.log
            override.tf
            override.tf.json
            *_override.tf
            *_override.tf.json
            .terraformrc
            terraform.rc
            
            # PACKER #
            
            packer_cache/
            crash.log
            *.box
            
            # PYTHON #
            
            __pycache__/
            *.py[cod]
            *$py.class
            *.so
            .Python
            build/
            develop-eggs/
            dist/
            downloads/
            eggs/
            .eggs/
            lib/
            lib64/
            parts/
            sdist/
            var/
            wheels/
            share/python-wheels/
            *.egg-info/
            .installed.cfg
            *.egg
            MANIFEST
            *.manifest
            *.spec
            pip-log.txt
            pip-delete-this-directory.txt
            htmlcov/
            .tox/
            .nox/
            .coverage
            .coverage.*
            .cache
            nosetests.xml
            coverage.xml
            *.cover
            *.py,cover
            .hypothesis/
            .pytest_cache/
            cover/
            *.mo
            *.pot
            *.log
            local_settings.py
            db.sqlite3
            db.sqlite3-journal
            instance/
            .webassets-cache
            .scrapy
            docs/_build/
            .pybuilder/
            target/
            .ipynb_checkpoints
            profile_default/
            ipython_config.py
            .python-version
            .pdm.toml
            __pypackages__/
            celerybeat-schedule
            celerybeat.pid
            *.sage.py
            .env
            .venv
            env/
            venv/
            ENV/
            env.bak/
            venv.bak/
            .spyderproject
            .spyproject
            .ropeproject
            /site
            .mypy_cache/
            .dmypy.json
            dmypy.json
            .pyre/
            .pytype/
            cython_debug/
            idea/
            
            # GOLANG #
            
            *.exe
            *.exe~
            *.dll
            *.so
            *.dylib
            *.test
            *.out
            vendor/
            go.work
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "nodejs-lab"
      + sha                 = (known after apply)
    }

  # github_repository_file.license_file["nodejs-lab"] will be created
  + resource "github_repository_file" "license_file" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by GMaC"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            This is free and unencumbered software released into the public domain.
            
            Anyone is free to copy, modify, publish, use, compile, sell, or
            distribute this software, either in source code form or as a compiled
            binary, for any purpose, commercial or non-commercial, and by any
            means.
            
            In jurisdictions that recognize copyright laws, the author or authors
            of this software dedicate any and all copyright interest in the
            software to the public domain. We make this dedication for the benefit
            of the public at large and to the detriment of our heirs and
            successors. We intend this dedication to be an overt act of
            relinquishment in perpetuity of all present and future rights to this
            software under copyright law.
            
            THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
            EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
            MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
            IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR
            OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
            ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
            OTHER DEALINGS IN THE SOFTWARE.
            
            For more information, please refer to <https://unlicense.org>
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "nodejs-lab"
      + sha                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ pub_http_clone_url = {
      + nodejs-lab       = (known after apply)
        # (3 unchanged elements hidden)
    }
  ~ pub_ssh_clone_url  = {
      + nodejs-lab       = (known after apply)
        # (3 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ricardo-f, Action: `pull_request`, Working Directory: ``, Workflow: `Repository creation workflow`*